Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_CSI.h
#define CSI_CR18_BASEADDR_CHANGE_ERROR_IE_MASK   (0x200U)
#define CSI_CR18_BASEADDR_CHANGE_ERROR_IE_SHIFT  (9U)
/*! BASEADDR_CHANGE_ERROR_IE
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define CSI_CR18_BASEADDR_CHANGE_ERROR_IE(x)     (((uint32_t)(((uint32_t)(x)) << CSI_CR18_BASEADDR_CHANGE_ERROR_IE_SHIFT)) & CSI_CR18_BASEADDR_CHANGE_ERROR_IE_MASK)

#define CSI_CR18_RGB888A_FORMAT_SEL_MASK         (0x400U)
#define CSI_CR18_RGB888A_FORMAT_SEL_SHIFT        (10U)
/*! RGB888A_FORMAT_SEL
 *  0b0..{8'h0, data[23:0]}
 *  0b1..{data[23:0], 8'h0}
 */
#define CSI_CR18_RGB888A_FORMAT_SEL(x)           (((uint32_t)(((uint32_t)(x)) << CSI_CR18_RGB888A_FORMAT_SEL_SHIFT)) & CSI_CR18_RGB888A_FORMAT_SEL_MASK)

#define CSI_CR18_AHB_HPROT_MASK                  (0xF000U)
#define CSI_CR18_AHB_HPROT_SHIFT                 (12U)
#define CSI_CR18_AHB_HPROT(x)                    (((uint32_t)(((uint32_t)(x)) << CSI_CR18_AHB_HPROT_SHIFT)) & CSI_CR18_AHB_HPROT_MASK)

#define CSI_CR18_MASK_OPTION_MASK                (0xC0000U)
#define CSI_CR18_MASK_OPTION_SHIFT               (18U)
/*! MASK_OPTION
 *  0b00..Writing to memory (OCRAM or external DDR) from first completely frame, when using this option, the CSI_ENABLE should be 1.
 *  0b01..Writing to memory when CSI_ENABLE is 1.
 *  0b10..Writing to memory from second completely frame, when using this option, the CSI_ENABLE should be 1.
 *  0b11..Writing to memory when data comes in, not matter the CSI_ENABLE is 1 or 0.
 */
#define CSI_CR18_MASK_OPTION(x)                  (((uint32_t)(((uint32_t)(x)) << CSI_CR18_MASK_OPTION_SHIFT)) & CSI_CR18_MASK_OPTION_MASK)

#define CSI_CR18_MIPI_DOUBLE_CMPNT_MASK          (0x100000U)
#define CSI_CR18_MIPI_DOUBLE_CMPNT_SHIFT         (20U)
/*! MIPI_DOUBLE_CMPNT
 *  0b0..Single component per clock cycle (half pixel per clock cycle)
 *  0b1..Double component per clock cycle (a pixel per clock cycle)
 */
#define CSI_CR18_MIPI_DOUBLE_CMPNT(x)            (((uint32_t)(((uint32_t)(x)) << CSI_CR18_MIPI_DOUBLE_CMPNT_SHIFT)) & CSI_CR18_MIPI_DOUBLE_CMPNT_MASK)

#define CSI_CR18_MIPI_YU_SWAP_MASK               (0x200000U)
#define CSI_CR18_MIPI_YU_SWAP_SHIFT              (21U)
/*! MIPI_YU_SWAP - It only works in MIPI CSI YUV422 double component mode. */
#define CSI_CR18_MIPI_YU_SWAP(x)                 (((uint32_t)(((uint32_t)(x)) << CSI_CR18_MIPI_YU_SWAP_SHIFT)) & CSI_CR18_MIPI_YU_SWAP_MASK)

#define CSI_CR18_DATA_FROM_MIPI_MASK             (0x400000U)
#define CSI_CR18_DATA_FROM_MIPI_SHIFT            (22U)
/*! DATA_FROM_MIPI
 *  0b0..Data from parallel sensor
 *  0b1..Data from MIPI
 */
#define CSI_CR18_DATA_FROM_MIPI(x)               (((uint32_t)(((uint32_t)(x)) << CSI_CR18_DATA_FROM_MIPI_SHIFT)) & CSI_CR18_DATA_FROM_MIPI_MASK)

#define CSI_CR18_LINE_STRIDE_EN_MASK             (0x1000000U)
#define CSI_CR18_LINE_STRIDE_EN_SHIFT            (24U)
#define CSI_CR18_LINE_STRIDE_EN(x)               (((uint32_t)(((uint32_t)(x)) << CSI_CR18_LINE_STRIDE_EN_SHIFT)) & CSI_CR18_LINE_STRIDE_EN_MASK)

#define CSI_CR18_MIPI_DATA_FORMAT_MASK           (0x7E000000U)
#define CSI_CR18_MIPI_DATA_FORMAT_SHIFT          (25U)
/*! MIPI_DATA_FORMAT - Image Data Format */
#define CSI_CR18_MIPI_DATA_FORMAT(x)             (((uint32_t)(((uint32_t)(x)) << CSI_CR18_MIPI_DATA_FORMAT_SHIFT)) & CSI_CR18_MIPI_DATA_FORMAT_MASK)

#define CSI_CR18_CSI_ENABLE_MASK                 (0x80000000U)
#define CSI_CR18_CSI_ENABLE_SHIFT                (31U)
#define CSI_CR18_CSI_ENABLE(x)                   (((uint32_t)(((uint32_t)(x)) << CSI_CR18_CSI_ENABLE_SHIFT)) & CSI_CR18_CSI_ENABLE_MASK)
/*! @} */

/*! @name CR19 - CSI Control Register 19 */
/*! @{ */

#define CSI_CR19_DMA_RFIFO_HIGHEST_FIFO_LEVEL_MASK (0xFFU)
#define CSI_CR19_DMA_RFIFO_HIGHEST_FIFO_LEVEL_SHIFT (0U)
#define CSI_CR19_DMA_RFIFO_HIGHEST_FIFO_LEVEL(x) (((uint32_t)(((uint32_t)(x)) << CSI_CR19_DMA_RFIFO_HIGHEST_FIFO_LEVEL_SHIFT)) & CSI_CR19_DMA_RFIFO_HIGHEST_FIFO_LEVEL_MASK)
/*! @} */

/*! @name CR20 - CSI Control Register 20 */
/*! @{ */

#define CSI_CR20_THRESHOLD_MASK                  (0xFFU)
#define CSI_CR20_THRESHOLD_SHIFT                 (0U)
#define CSI_CR20_THRESHOLD(x)                    (((uint32_t)(((uint32_t)(x)) << CSI_CR20_THRESHOLD_SHIFT)) & CSI_CR20_THRESHOLD_MASK)

#define CSI_CR20_BINARY_EN_MASK                  (0x100U)
#define CSI_CR20_BINARY_EN_SHIFT                 (8U)
/*! BINARY_EN
 *  0b0..Output is Y8 format(8 bits each pixel)
 *  0b1..Output is Y1 format(1 bit each pixel)
 */
#define CSI_CR20_BINARY_EN(x)                    (((uint32_t)(((uint32_t)(x)) << CSI_CR20_BINARY_EN_SHIFT)) & CSI_CR20_BINARY_EN_MASK)

#define CSI_CR20_QR_DATA_FORMAT_MASK             (0xE00U)
#define CSI_CR20_QR_DATA_FORMAT_SHIFT            (9U)
/*! QR_DATA_FORMAT
 *  0b000..YU YV one cycle per 1 pixel input
 *  0b001..UY VY one cycle per1 pixel input
 *  0b010..Y U Y V two cycles per 1 pixel input
 *  0b011..U Y V Y two cycles per 1 pixel input
 *  0b100..YUV one cycle per 1 pixel input
 *  0b101..Y U V three cycles per 1 pixel input
 */
#define CSI_CR20_QR_DATA_FORMAT(x)               (((uint32_t)(((uint32_t)(x)) << CSI_CR20_QR_DATA_FORMAT_SHIFT)) & CSI_CR20_QR_DATA_FORMAT_MASK)

#define CSI_CR20_BIG_END_MASK                    (0x1000U)
#define CSI_CR20_BIG_END_SHIFT                   (12U)
/*! BIG_END
 *  0b0..The newest (most recent) data will be assigned the lowest position when store to memory.
 *  0b1..The newest (most recent) data will be assigned the highest position when store to memory.
 */
#define CSI_CR20_BIG_END(x)                      (((uint32_t)(((uint32_t)(x)) << CSI_CR20_BIG_END_SHIFT)) & CSI_CR20_BIG_END_MASK)

#define CSI_CR20_10BIT_NEW_EN_MASK               (0x20000000U)
#define CSI_CR20_10BIT_NEW_EN_SHIFT              (29U)
/*! 10BIT_NEW_EN
 *  0b0..When input 8bits data, it will use the data[9:2]
 *  0b1..If input is 10bits data, it will use the data[7:0] (optional)
 */
#define CSI_CR20_10BIT_NEW_EN(x)                 (((uint32_t)(((uint32_t)(x)) << CSI_CR20_10BIT_NEW_EN_SHIFT)) & CSI_CR20_10BIT_NEW_EN_MASK)

